Show / Hide Table of Contents
Class BIMItemId
Inheritance
System.Object
BIMItemId
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[DataContract]
public class BIMItemId
Properties
Improve this Doc   View Source
Id
Declaration
[DataMember]
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Type
Declaration
[DataMember]
public BIMItemType Type { get; set; }
Property Value
 Type |  Description
 BIMItemType
 Improve this Doc
 View Source